#### Terraform Format and Style 🖌``
#### Terraform Initialization ⚙️``
#### Terraform Plan 📖`success`
#### Terraform Validation 🤖``

<details><summary>Show Plan</summary>

```

terraform
Running plan in HCP Terraform. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/flcdrg/terraform-azure-sql-auditing/runs/run-hfjx7L5NpkyfQuHd

Waiting for the plan to start...

Terraform v1.10.5
on linux_amd64
Initializing plugins and modules...
random_password.password: Refreshing state... [id=none]
data.azurerm_resource_group.rg: Refreshing...
data.azurerm_client_config.current: Refreshing...
data.azurerm_client_config.current: Refresh complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD01MjUwMzk4Zi00YjFjLTQzZTktOTgyMy04ZDRlNTk4MGEyMDE7b2JqZWN0SWQ9ZGU0NDc1ZGUtODhiMS00YTc0LWFmNGUtZjA2MjM3MGM5MzY3O3N1YnNjcmlwdGlvbklkPWI0YjJlN2U5LTY2ZTctNDZiNS1hNTZiLWNjZTJiNTAwMTFkNDt0ZW5hbnRJZD01OWIwOTM0ZC00ZjM1LTRiZmYtYTJiNy1hNDUxZmU1ZjhiZDY=]
data.azurerm_resource_group.rg: Refresh complete after 1s [id=/subscriptions/b4b2e7e9-66e7-46b5-a56b-cce2b50011d4/resourceGroups/rg-terraform-sql-auditing-australiaeast]
azurerm_eventhub_namespace.eh: Refreshing state... [id=/subscriptions/b4b2e7e9-66e7-46b5-a56b-cce2b50011d4/resourceGroups/rg-terraform-sql-auditing-australiaeast/providers/Microsoft.EventHub/namespaces/evhns-terraform-sql-auditing-australiaeast]
azurerm_log_analytics_workspace.la: Refreshing state... [id=/subscriptions/b4b2e7e9-66e7-46b5-a56b-cce2b50011d4/resourceGroups/rg-terraform-sql-auditing-australiaeast/providers/Microsoft.OperationalInsights/workspaces/log-terraform-sql-auditing-australiaeast]
azurerm_mssql_server.mssql: Refreshing state... [id=/subscriptions/b4b2e7e9-66e7-46b5-a56b-cce2b50011d4/resourceGroups/rg-terraform-sql-auditing-australiaeast/providers/Microsoft.Sql/servers/sql-terraform-sql-auditing-australiaeast]
azurerm_storage_account.storage: Refreshing state... [id=/subscriptions/b4b2e7e9-66e7-46b5-a56b-cce2b50011d4/resourceGroups/rg-terraform-sql-auditing-australiaeast/providers/Microsoft.Storage/storageAccounts/sttfsqlauditaue]
azurerm_mssql_firewall_rule.azure_services: Refreshing state... [id=/subscriptions/b4b2e7e9-66e7-46b5-a56b-cce2b50011d4/resourceGroups/rg-terraform-sql-auditing-australiaeast/providers/Microsoft.Sql/servers/sql-terraform-sql-auditing-australiaeast/firewallRules/AllowAzure]
azurerm_mssql_database.primary: Refreshing state... [id=/subscriptions/b4b2e7e9-66e7-46b5-a56b-cce2b50011d4/resourceGroups/rg-terraform-sql-auditing-australiaeast/providers/Microsoft.Sql/servers/sql-terraform-sql-auditing-australiaeast/databases/sqldb-terraform-sql-auditing-australiaeast]
azurerm_eventhub_namespace_authorization_rule.eh: Refreshing state... [id=/subscriptions/b4b2e7e9-66e7-46b5-a56b-cce2b50011d4/resourceGroups/rg-terraform-sql-auditing-australiaeast/providers/Microsoft.EventHub/namespaces/evhns-terraform-sql-auditing-australiaeast/authorizationRules/evhar-terraform-sql-auditing-australiaeast]
azurerm_eventhub.eh: Refreshing state... [id=/subscriptions/b4b2e7e9-66e7-46b5-a56b-cce2b50011d4/resourceGroups/rg-terraform-sql-auditing-australiaeast/providers/Microsoft.EventHub/namespaces/evhns-terraform-sql-auditing-australiaeast/eventhubs/evh-terraform-sql-auditing-australiaeast]
azurerm_monitor_diagnostic_setting.mssql_server: Refreshing state... [id=/subscriptions/b4b2e7e9-66e7-46b5-a56b-cce2b50011d4/resourceGroups/rg-terraform-sql-auditing-australiaeast/providers/Microsoft.Sql/servers/sql-terraform-sql-auditing-australiaeast/databases/master|diagnostic_setting]
azurerm_mssql_server_extended_auditing_policy.auditing: Refreshing state... [id=/subscriptions/b4b2e7e9-66e7-46b5-a56b-cce2b50011d4/resourceGroups/rg-terraform-sql-auditing-australiaeast/providers/Microsoft.Sql/servers/sql-terraform-sql-auditing-australiaeast/extendedAuditingSettings/default]
azurerm_monitor_diagnostic_setting.mssql_server: Drift detected (update)

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # azurerm_monitor_diagnostic_setting.mssql_server will be updated in-place
  ~ resource "azurerm_monitor_diagnostic_setting" "mssql_server" {
        id                             = "/subscriptions/b4b2e7e9-66e7-46b5-a56b-cce2b50011d4/resourceGroups/rg-terraform-sql-auditing-australiaeast/providers/Microsoft.Sql/servers/sql-terraform-sql-auditing-australiaeast/databases/master|diagnostic_setting"
      + log_analytics_destination_type = "Dedicated"
        name                           = "diagnostic_setting"
        # (4 unchanged attributes hidden)

      - metric {
          - category = "Basic" -> null
          - enabled  = false -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }
      - metric {
          - category = "InstanceAndAppAdvanced" -> null
          - enabled  = false -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }
      - metric {
          - category = "WorkloadManagement" -> null
          - enabled  = false -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }

        # (1 unchanged block hidden)
    }

  # azurerm_mssql_server_extended_auditing_policy.auditing will be updated in-place
  ~ resource "azurerm_mssql_server_extended_auditing_policy" "auditing" {
        id                                      = "/subscriptions/b4b2e7e9-66e7-46b5-a56b-cce2b50011d4/resourceGroups/rg-terraform-sql-auditing-australiaeast/providers/Microsoft.Sql/servers/sql-terraform-sql-auditing-australiaeast/extendedAuditingSettings/default"
      - storage_account_access_key              = (sensitive value) -> null
        # (9 unchanged attributes hidden)
    }

  # azurerm_role_assignment.mssql_has_storage_blob_data_contributor will be created
  + resource "azurerm_role_assignment" "mssql_has_storage_blob_data_contributor" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "83e43207-4e69-42b0-aaf0-0d0eab6702a2"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Storage Blob Data Contributor"
      + scope                            = "/subscriptions/b4b2e7e9-66e7-46b5-a56b-cce2b50011d4/resourceGroups/rg-terraform-sql-auditing-australiaeast/providers/Microsoft.Storage/storageAccounts/sttfsqlauditaue"
      + skip_service_principal_aad_check = (known after apply)
    }

  # azurerm_storage_account.storage will be updated in-place
  ~ resource "azurerm_storage_account" "storage" {
      ~ allow_nested_items_to_be_public    = true -> false
        id                                 = "/subscriptions/b4b2e7e9-66e7-46b5-a56b-cce2b50011d4/resourceGroups/rg-terraform-sql-auditing-australiaeast/providers/Microsoft.Storage/storageAccounts/sttfsqlauditaue"
        name                               = "sttfsqlauditaue"
        tags                               = {}
        # (95 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

Plan: 1 to add, 3 to change, 0 to destroy.

------------------------------------------------------------------------

Cost Estimation:

Resources: 0 of 11 estimated
           $0.0/mo +$0.0

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pushed by: @flcdrg, Action: `pull_request`*